---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.NameNotUnique
source: html/ffa3cea6-e76b-381a-4d95-f6917c2e9452.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.NameNotUnique Property

The name entered is already in use. Enter a unique name.

## Syntax (C#)
```csharp
public static FailureDefinitionId NameNotUnique { get; }
```